-- Вывод консолидированных данных

SELECT
	order_num AS  "Номер заказа",
	bill_rub AS "Общая сумма",
	tips AS "Чаевые",
	e.name AS "Официант",
	d.name AS "Блюдо",
	i.name AS "Ингредиент", 
	i.calories  AS "Калории ингредиента"
FROM orders o
JOIN employees e 
	ON o.waiter_id = e.id 
JOIN order_dishes od 
	ON o.id = od.order_id	
JOIN dishes d
	ON od.dish_id = d.id
JOIN recipes r
	ON d.id = r.dish_id
JOIN ingredients i 
	ON r.ingredient_id = i.id 
ORDER BY 5, 6	
	
/*
Номер заказа|Общая сумма|Чаевые|Официант   |Блюдо       |Ингредиент |Калории ингредиента|
------------+-----------+------+-----------+------------+-----------+-------------------+
  ИП_заказ_1|        400|    50|Петров Петр|гипер-бургер|булочка    |                100|
  ИП_заказ_1|        400|    50|Петров Петр|гипер-бургер|котлета    |                200|
  ИП_заказ_1|        400|    50|Петров Петр|гипер-бургер|лист зелени|                  0|
  ИП_заказ_1|        400|    50|Петров Петр|лимонад     |вода       |                  0|
  ИП_заказ_1|        400|    50|Петров Петр|лимонад     |лимон      |                 10|
*/


